---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.Dispose
source: html/015d4647-1bb1-6197-7c3b-c87b15e62bc8.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.Dispose Method

Releases all resources used by the ExportLinetypeTable

## Syntax (C#)
```csharp
public void Dispose()
```